## Заливка данных

##### Импорт библиотек

In [1]:
import pandas as pd
import numpy as np
import sqlite3

In [2]:
sqlite3.sqlite_version

'3.39.4'

##### Подключение к БД

In [3]:
con = sqlite3.connect('db')

## Colab

In [7]:
! gdown --id 1cUYNwlHjUZ6gZZMSFBdX0NCnvgRTprsQ

df = pd.read_csv('/content/german_credit_augmented.csv')

"gdown" ­Ґ пў«пҐвбп ў­гваҐ­­Ґ© Ё«Ё ў­Ґи­Ґ©
Є®¬ ­¤®©, ЁбЇ®«­пҐ¬®© Їа®Ја ¬¬®© Ё«Ё Ї ЄҐв­л¬ д ©«®¬.

FileNotFoundError: [Errno 2] No such file or directory: '/content/german_credit_augmented.csv'

## Pycharm

In [4]:
df = pd.read_csv(
    r'C:\PyCharm\Python\SQL_for_data_analysis\2.DB_connect_and_upload\sql-course-main\german_credit_augmented.csv')

In [5]:
df

,age,sex,job,housing,saving_accounts,checking_account,credit_amount,duration,purpose,default,contract_dt,client_id
0,33,male,2,own,NaN,NaN,3074,9,radio/TV,0,2008-06-29 18:52:00,210
1,43,male,1,own,little,little,1344,12,car,0,2007-05-20 18:30:19,929
2,52,male,2,own,quite rich,NaN,936,9,education,0,2008-04-27 08:23:07,200
3,35,female,3,own,little,NaN,1393,11,car,0,2007-05-06 10:58:22,45
4,28,male,2,own,little,NaN,776,12,radio/TV,0,2007-07-21 13:22:14,358
...,...,...,...,...,...,...,...,...,...,...,...,...
995,65,male,2,free,little,little,2600,18,radio/TV,1,2007-12-16 20:17:19,624
996,30,male,3,own,little,moderate,4455,36,business,1,2007-07-12 14:08:58,181
997,33,male,2,own,little,moderate,6403,24,radio/TV,0,2008-04-08 03:24:26,730
998,29,female,2,own,NaN,NaN,5003,21,car,1,2007-11-29 15:51:45,557
999,44,male,2,own,moderate,moderate,1804,12,car,0,2007-08-14 09:05:33,23

In [6]:
df.dtypes

age                  int64
sex                 object
job                  int64
housing             object
saving_accounts     object
checking_account    object
credit_amount        int64
duration             int64
purpose             object
default              int64
contract_dt         object
client_id            int64
dtype: object

In [7]:
df.contract_dt = pd.to_datetime(df.contract_dt, format='%Y-%m-%d %H:%M:%S')

In [8]:
df.dtypes

age                          int64
sex                         object
job                          int64
housing                     object
saving_accounts             object
checking_account            object
credit_amount                int64
duration                     int64
purpose                     object
default                      int64
contract_dt         datetime64[ns]
client_id                    int64
dtype: object

In [9]:
df.to_sql('german_credit', con, index=False, if_exists='replace')

1000

## Select

In [10]:
def select(sql):
    return pd.read_sql(sql, con)

In [11]:
sql = '''select * from german_credit t'''

In [12]:
select(sql)

,age,sex,job,housing,saving_accounts,checking_account,credit_amount,duration,purpose,default,contract_dt,client_id
0,33,male,2,own,None,None,3074,9,radio/TV,0,2008-06-29 18:52:00,210
1,43,male,1,own,little,little,1344,12,car,0,2007-05-20 18:30:19,929
2,52,male,2,own,quite rich,None,936,9,education,0,2008-04-27 08:23:07,200
3,35,female,3,own,little,None,1393,11,car,0,2007-05-06 10:58:22,45
4,28,male,2,own,little,None,776,12,radio/TV,0,2007-07-21 13:22:14,358
...,...,...,...,...,...,...,...,...,...,...,...,...
995,65,male,2,free,little,little,2600,18,radio/TV,1,2007-12-16 20:17:19,624
996,30,male,3,own,little,moderate,4455,36,business,1,2007-07-12 14:08:58,181
997,33,male,2,own,little,moderate,6403,24,radio/TV,0,2008-04-08 03:24:26,730
998,29,female,2,own,None,None,5003,21,car,1,2007-11-29 15:51:45,557
999,44,male,2,own,moderate,moderate,1804,12,car,0,2007-08-14 09:05:33,23

## Group by

In [13]:
sql = '''SELECT t.sex,
count(*),
avg(t.credit_amount) AS credit_amount_avg

FROM german_credit t
GROUP BY sex'''

In [14]:
select(sql)

      sex  count(*)  credit_amount_avg
0  female       310        2877.774194
1    male       690        3448.040580

То же самое но в pandas

In [15]:
df.groupby('sex').credit_amount.agg(['count', 'mean'])

        count         mean
sex
female    310  2877.774194
male      690  3448.040580

#### Подсчёт уникальных значений

In [21]:
sql = '''select distinct t.housing from german_credit t'''

In [22]:
select(sql)

  housing
0     own
1    rent
2    free

In [31]:
sql = '''SELECT t.housing,
count(*),
avg(t.credit_amount) AS credit_amount_avg

FROM german_credit t
GROUP BY t.housing'''

In [32]:
select(sql)

  housing  count(*)  credit_amount_avg
0    free       108        4906.212963
1     own       713        3060.939691
2    rent       179        3122.553073

In [33]:
sql = '''select * from german_credit t'''

In [34]:
select(sql)

,age,sex,job,housing,saving_accounts,checking_account,credit_amount,duration,purpose,default,contract_dt,client_id
0,33,male,2,own,None,None,3074,9,radio/TV,0,2008-06-29 18:52:00,210
1,43,male,1,own,little,little,1344,12,car,0,2007-05-20 18:30:19,929
2,52,male,2,own,quite rich,None,936,9,education,0,2008-04-27 08:23:07,200
3,35,female,3,own,little,None,1393,11,car,0,2007-05-06 10:58:22,45
4,28,male,2,own,little,None,776,12,radio/TV,0,2007-07-21 13:22:14,358
...,...,...,...,...,...,...,...,...,...,...,...,...
995,65,male,2,free,little,little,2600,18,radio/TV,1,2007-12-16 20:17:19,624
996,30,male,3,own,little,moderate,4455,36,business,1,2007-07-12 14:08:58,181
997,33,male,2,own,little,moderate,6403,24,radio/TV,0,2008-04-08 03:24:26,730
998,29,female,2,own,None,None,5003,21,car,1,2007-11-29 15:51:45,557
999,44,male,2,own,moderate,moderate,1804,12,car,0,2007-08-14 09:05:33,23

Посмотрим ещё один столбец, например checking account

In [37]:
sql = '''select t.checking_account from german_credit t'''

In [38]:
select(sql)

    checking_account
0               None
1             little
2               None
3               None
4               None
..               ...
995           little
996         moderate
997         moderate
998             None
999         moderate

[1000 rows x 1 columns]

Проверка на пропуски
Количество введённых данных и количество строк всего

In [41]:
sql = '''select count(t.checking_account), count(*) from german_credit t'''

In [42]:
select(sql)

   count(t.checking_account)  count(*)
0                        606      1000

Добавим чекинг аккаунт в сводник

In [43]:
sql = '''SELECT t.checking_account,
count(*),
avg(t.credit_amount) AS credit_amount_avg

FROM german_credit t
GROUP BY t.checking_account'''

In [44]:
select(sql)

  checking_account  count(*)  credit_amount_avg
0             None       394        3133.101523
1           little       274        3175.218978
2         moderate       269        3827.561338
3             rich        63        2177.650794

SQL УЧИТЫВАЕТ пропуски по умолчанию
Pandas НЕ УЧИТЫВАЕТ пропуски по умолчанию

In [48]:
df.groupby('checking_account').credit_amount.count()

checking_account
little      274
moderate    269
rich         63
Name: credit_amount, dtype: int64

In [49]:
df.groupby('checking_account').credit_amount.count().sum()

606

Для учёта пропусков в Pandas нужно прописывать dropna=False

In [50]:
df.groupby('checking_account', dropna=False).credit_amount.count()

checking_account
little      274
moderate    269
rich         63
NaN         394
Name: credit_amount, dtype: int64

Посмотрим количество пропусков, а не количество заполненых значений
Сначала добавим поле если есть пропуск
Затем проссумируем строки

In [55]:
sql = '''select t.checking_account,
case when t.checking_account is null then 1 else 0 end

from german_credit t'''

In [56]:
select(sql)

    checking_account  case when t.checking_account is null then 1 else 0 end
0               None                                                  1
1             little                                                  0
2               None                                                  1
3               None                                                  1
4               None                                                  1
..               ...                                                ...
995           little                                                  0
996         moderate                                                  0
997         moderate                                                  0
998             None                                                  1
999         moderate                                                  0

[1000 rows x 2 columns]

Подсчёт пропусков через sum и через count

In [63]:
sql = '''select
sum(case when t.checking_account is null then 1 else 0 end) as is_null,
count(case when t.checking_account is null then 1 else null end) as is_null2
from german_credit t'''

In [64]:
select(sql)

   is_null  is_null2
0      394       394

 Создадим искусственную таблицу для тренировки

In [72]:
t = pd.DataFrame({'col1': [1, np.nan, 2]})

In [73]:
t

   col1
0   1.0
1   NaN
2   2.0

In [74]:
t.to_sql('null_test', con, index=False, if_exists='replace')

3

In [75]:
sql = '''select * from null_test t '''

In [76]:
select(sql)

   col1
0   1.0
1   NaN
2   2.0

Показывает 2 значения, пропуск игнорирует

In [79]:
sql = '''select count(t.col1) from null_test t'''

In [80]:
select(sql)

   count(t.col1)
0              2

В сумме также игнорирует пропуск

In [81]:
sql = '''select sum(t.col1) from null_test t'''

In [82]:
select(sql)

   sum(t.col1)
0          3.0

В среднем так же игнорирует пропуск

In [83]:
sql = '''select avg(t.col1) from null_test t'''

In [84]:
select(sql)

   avg(t.col1)
0          1.5

#### Заполнение пропусков

In [87]:
sql = '''select
t.checking_account


from german_credit t'''

In [88]:
select(sql)

    checking_account
0               None
1             little
2               None
3               None
4               None
..               ...
995           little
996         moderate
997         moderate
998             None
999         moderate

[1000 rows x 1 columns]

Подставляем no_info вместо None

In [89]:
sql = '''select
t.checking_account,
coalesce(t.checking_account, 'no_info')

from german_credit t'''

In [90]:
select(sql)

    checking_account coalesce(t.checking_account, 'no_info')
0               None                                 no_info
1             little                                  little
2               None                                 no_info
3               None                                 no_info
4               None                                 no_info
..               ...                                     ...
995           little                                  little
996         moderate                                moderate
997         moderate                                moderate
998             None                                 no_info
999         moderate                                moderate

[1000 rows x 2 columns]

Ещё один пример
Пропуски заменим нулями

In [93]:
sql = '''select * from null_test t '''

In [94]:
select(sql)

   col1
0   1.0
1   NaN
2   2.0

In [97]:
sql = '''select coalesce(t.col1,0) as col1_whithout_none

from null_test t '''

In [98]:
select(sql)

   col1_whithout_none
0                 1.0
1                 0.0
2                 2.0

Теперь можно посчитать по данной таблице среднее и она будет учитывать новый нуль

In [101]:
sql = '''select avg(coalesce(t.col1,0)) as col1_whithout_none

from null_test t '''

In [102]:
select(sql)

   col1_whithout_none
0                 1.0

Дополним таблицу

In [103]:
t = pd.DataFrame({'col1': [1, np.nan, 2],
                  'col2': [np.nan, np.nan, 1],
                  'col3': [1, 2, 3]})

In [104]:
t

   col1  col2  col3
0   1.0   NaN     1
1   NaN   NaN     2
2   2.0   1.0     3

In [105]:
t.to_sql('null_test', con, index=False, if_exists='replace')

3

In [106]:
sql = '''select * from null_test t'''

In [107]:
select(sql)

   col1  col2  col3
0   1.0   NaN     1
1   NaN   NaN     2
2   2.0   1.0     3

Выберем столбец, который первый не имеет пропусков, начиная с первого и т.д.

In [108]:
sql = '''select t.*, coalesce(t.col1,t.col2,t.col3) from null_test t'''

In [109]:
select(sql)

   col1  col2  col3  coalesce(t.col1,t.col2,t.col3)
0   1.0   NaN     1                             1.0
1   NaN   NaN     2                             2.0
2   2.0   1.0     3                             2.0